Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_SEMC.h
/*! @name MCR - Module Control Register */
/*! @{ */

#define SEMC_MCR_SWRST_MASK                      (0x1U)
#define SEMC_MCR_SWRST_SHIFT                     (0U)
/*! SWRST - Software Reset
 *  0b0..No reset
 *  0b1..Reset
 */
#define SEMC_MCR_SWRST(x)                        (((uint32_t)(((uint32_t)(x)) << SEMC_MCR_SWRST_SHIFT)) & SEMC_MCR_SWRST_MASK)

#define SEMC_MCR_MDIS_MASK                       (0x2U)
#define SEMC_MCR_MDIS_SHIFT                      (1U)
/*! MDIS - Module Disable
 *  0b0..Module enabled
 *  0b1..Module disabled
 */
#define SEMC_MCR_MDIS(x)                         (((uint32_t)(((uint32_t)(x)) << SEMC_MCR_MDIS_SHIFT)) & SEMC_MCR_MDIS_MASK)

#define SEMC_MCR_DQSMD_MASK                      (0x4U)
#define SEMC_MCR_DQSMD_SHIFT                     (2U)
/*! DQSMD - DQS (read strobe) mode
 *  0b0..Dummy read strobe loopbacked internally
 *  0b1..Dummy read strobe loopbacked from DQS pad
 */
#define SEMC_MCR_DQSMD(x)                        (((uint32_t)(((uint32_t)(x)) << SEMC_MCR_DQSMD_SHIFT)) & SEMC_MCR_DQSMD_MASK)

#define SEMC_MCR_WPOL0_MASK                      (0x40U)
#define SEMC_MCR_WPOL0_SHIFT                     (6U)
/*! WPOL0 - WAIT/RDY polarity for SRAM/NOR
 *  0b0..WAIT/RDY polarity is not changed.
 *  0b1..WAIT/RDY polarity is inverted.
 */
#define SEMC_MCR_WPOL0(x)                        (((uint32_t)(((uint32_t)(x)) << SEMC_MCR_WPOL0_SHIFT)) & SEMC_MCR_WPOL0_MASK)

#define SEMC_MCR_WPOL1_MASK                      (0x80U)
#define SEMC_MCR_WPOL1_SHIFT                     (7U)
/*! WPOL1 - R/B# polarity for NAND device
 *  0b0..R/B# polarity is not changed.
 *  0b1..R/B# polarity is inverted.
 */
#define SEMC_MCR_WPOL1(x)                        (((uint32_t)(((uint32_t)(x)) << SEMC_MCR_WPOL1_SHIFT)) & SEMC_MCR_WPOL1_MASK)

#define SEMC_MCR_CTO_MASK                        (0xFF0000U)
#define SEMC_MCR_CTO_SHIFT                       (16U)
/*! CTO - Command Execution timeout cycles */
#define SEMC_MCR_CTO(x)                          (((uint32_t)(((uint32_t)(x)) << SEMC_MCR_CTO_SHIFT)) & SEMC_MCR_CTO_MASK)

#define SEMC_MCR_BTO_MASK                        (0x1F000000U)
#define SEMC_MCR_BTO_SHIFT                       (24U)
/*! BTO - Bus timeout cycles
 *  0b00000..255*1
 *  0b00001..255*2
 *  0b11111..255*2^31
 */
#define SEMC_MCR_BTO(x)                          (((uint32_t)(((uint32_t)(x)) << SEMC_MCR_BTO_SHIFT)) & SEMC_MCR_BTO_MASK)
/*! @} */

/*! @name IOCR - IO MUX Control Register */
/*! @{ */

#define SEMC_IOCR_MUX_A8_MASK                    (0xFU)
#define SEMC_IOCR_MUX_A8_SHIFT                   (0U)
/*! MUX_A8 - SEMC_ADDR08 output selection
 *  0b0000-0b0011..SDRAM Address bit 8 (A8) or NOR/SRAM Address bit 24 (A24) in ADMUX 16bit mode
 *  0b0100..NAND CE#
 *  0b0101..NOR CE#
 *  0b0110..SRAM CE# 0
 *  0b0111..DBI CSX
 *  0b1000..SRAM CE# 1
 *  0b1001..SRAM CE# 2
 *  0b1010..SRAM CE# 3
 *  0b1011-0b1111..SDRAM Address bit 8 (A8) or NOR/SRAM Address bit 24 (A24) in ADMUX 16bit mode
 */
#define SEMC_IOCR_MUX_A8(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_IOCR_MUX_A8_SHIFT)) & SEMC_IOCR_MUX_A8_MASK)

#define SEMC_IOCR_MUX_CSX0_MASK                  (0xF0U)
#define SEMC_IOCR_MUX_CSX0_SHIFT                 (4U)
/*! MUX_CSX0 - SEMC_CSX0 output selection
 *  0b0000..NOR/SRAM Address bit 24 (A24) in Non-ADMUX mode
 *  0b0001..SDRAM CS1
 *  0b0010..SDRAM CS2
 *  0b0011..SDRAM CS3
 *  0b0100..NAND CE#
 *  0b0101..NOR CE#
 *  0b0110..SRAM CE# 0
 *  0b0111..DBI CSX
 *  0b1000..SRAM CE# 1
 *  0b1001..SRAM CE# 2
 *  0b1010..SRAM CE# 3
 *  0b1011-0b1111..NOR/SRAM Address bit 24 (A24) in Non-ADMUX mode
 */
#define SEMC_IOCR_MUX_CSX0(x)                    (((uint32_t)(((uint32_t)(x)) << SEMC_IOCR_MUX_CSX0_SHIFT)) & SEMC_IOCR_MUX_CSX0_MASK)

#define SEMC_IOCR_MUX_CSX1_MASK                  (0xF00U)
#define SEMC_IOCR_MUX_CSX1_SHIFT                 (8U)
/*! MUX_CSX1 - SEMC_CSX1 output selection
 *  0b0000..NOR/SRAM Address bit 25 (A25) in Non-ADMUX mode
 *  0b0001..SDRAM CS1
 *  0b0010..SDRAM CS2
 *  0b0011..SDRAM CS3
 *  0b0100..NAND CE#
 *  0b0101..NOR CE#
 *  0b0110..SRAM CE# 0
 *  0b0111..DBI CSX
 *  0b1000..SRAM CE# 1
 *  0b1001..SRAM CE# 2
 *  0b1010..SRAM CE# 3
 *  0b1011-0b1111..NOR/SRAM Address bit 25 (A25) in Non-ADMUX mode
 */
#define SEMC_IOCR_MUX_CSX1(x)                    (((uint32_t)(((uint32_t)(x)) << SEMC_IOCR_MUX_CSX1_SHIFT)) & SEMC_IOCR_MUX_CSX1_MASK)

#define SEMC_IOCR_MUX_CSX2_MASK                  (0xF000U)
#define SEMC_IOCR_MUX_CSX2_SHIFT                 (12U)
/*! MUX_CSX2 - SEMC_CSX2 output selection
 *  0b0000..NOR/SRAM Address bit 26 (A26) in Non-ADMUX mode
 *  0b0001..SDRAM CS1
 *  0b0010..SDRAM CS2
 *  0b0011..SDRAM CS3
 *  0b0100..NAND CE#
 *  0b0101..NOR CE#
 *  0b0110..SRAM CE# 0
 *  0b0111..DBI CSX
 *  0b1000..SRAM CE# 1
 *  0b1001..SRAM CE# 2
 *  0b1010..SRAM CE# 3
 *  0b1011-0b1111..NOR/SRAM Address bit 26 (A26) in Non-ADMUX mode
 */
#define SEMC_IOCR_MUX_CSX2(x)                    (((uint32_t)(((uint32_t)(x)) << SEMC_IOCR_MUX_CSX2_SHIFT)) & SEMC_IOCR_MUX_CSX2_MASK)

#define SEMC_IOCR_MUX_CSX3_MASK                  (0xF0000U)
#define SEMC_IOCR_MUX_CSX3_SHIFT                 (16U)
/*! MUX_CSX3 - SEMC_CSX3 output selection
 *  0b0000..NOR/SRAM Address bit 27 (A27) in Non-ADMUX mode
 *  0b0001..SDRAM CS1
 *  0b0010..SDRAM CS2
 *  0b0011..SDRAM CS3
 *  0b0100..NAND CE#
 *  0b0101..NOR CE#
 *  0b0110..SRAM CE# 0
 *  0b0111..DBI CSX
 *  0b1000..SRAM CE# 1
 *  0b1001..SRAM CE# 2
 *  0b1010..SRAM CE# 3
 *  0b1011-0b1111..NOR/SRAM Address bit 27 (A27) in Non-ADMUX mode
 */
#define SEMC_IOCR_MUX_CSX3(x)                    (((uint32_t)(((uint32_t)(x)) << SEMC_IOCR_MUX_CSX3_SHIFT)) & SEMC_IOCR_MUX_CSX3_MASK)

#define SEMC_IOCR_MUX_RDY_MASK                   (0xF00000U)
#define SEMC_IOCR_MUX_RDY_SHIFT                  (20U)
/*! MUX_RDY - SEMC_RDY function selection
 *  0b0000..NAND R/B# input
 *  0b0001..SDRAM CS1
 *  0b0010..SDRAM CS2
 *  0b0011..SDRAM CS3
 *  0b0100..NOR/SRAM Address bit 27 (A27) in Non-ADMUX mode
 *  0b0101..NOR CE#
 *  0b0110..SRAM CE# 0
 *  0b0111..DBI CSX
 *  0b1000..SRAM CE# 1
 *  0b1001..SRAM CE# 2
 *  0b1010..SRAM CE# 3
 *  0b1011-0b1111..NOR/SRAM Address bit 27 in Non-ADMUX mode
 */
#define SEMC_IOCR_MUX_RDY(x)                     (((uint32_t)(((uint32_t)(x)) << SEMC_IOCR_MUX_RDY_SHIFT)) & SEMC_IOCR_MUX_RDY_MASK)

#define SEMC_IOCR_MUX_CLKX0_MASK                 (0x3000000U)
#define SEMC_IOCR_MUX_CLKX0_SHIFT                (24U)
/*! MUX_CLKX0 - SEMC_CLKX0 function selection
 *  0b00..Keep low
 *  0b01..NOR clock
 *  0b10..SRAM clock
 *  0b11..NOR and SRAM clock, suitable for Multi-Chip Product package
 */
#define SEMC_IOCR_MUX_CLKX0(x)                   (((uint32_t)(((uint32_t)(x)) << SEMC_IOCR_MUX_CLKX0_SHIFT)) & SEMC_IOCR_MUX_CLKX0_MASK)

#define SEMC_IOCR_MUX_CLKX1_MASK                 (0xC000000U)
#define SEMC_IOCR_MUX_CLKX1_SHIFT                (26U)
/*! MUX_CLKX1 - SEMC_CLKX1 function selection
 *  0b00..Keep low
 *  0b01..NOR clock
 *  0b10..SRAM clock
 *  0b11..NOR and SRAM clock, suitable for Multi-Chip Product package
 */
#define SEMC_IOCR_MUX_CLKX1(x)                   (((uint32_t)(((uint32_t)(x)) << SEMC_IOCR_MUX_CLKX1_SHIFT)) & SEMC_IOCR_MUX_CLKX1_MASK)

#define SEMC_IOCR_CLKX0_AO_MASK                  (0x10000000U)
#define SEMC_IOCR_CLKX0_AO_SHIFT                 (28U)
/*! CLKX0_AO - SEMC_CLKX0 Always On
 *  0b0..SEMC_CLKX0 is controlled by MUX_CLKX0
 *  0b1..SEMC_CLKX0 is always on
 */
#define SEMC_IOCR_CLKX0_AO(x)                    (((uint32_t)(((uint32_t)(x)) << SEMC_IOCR_CLKX0_AO_SHIFT)) & SEMC_IOCR_CLKX0_AO_MASK)

#define SEMC_IOCR_CLKX1_AO_MASK                  (0x20000000U)
#define SEMC_IOCR_CLKX1_AO_SHIFT                 (29U)
/*! CLKX1_AO - SEMC_CLKX1 Always On
 *  0b0..SEMC_CLKX1 is controlled by MUX_CLKX1
 *  0b1..SEMC_CLKX1 is always on
 */
#define SEMC_IOCR_CLKX1_AO(x)                    (((uint32_t)(((uint32_t)(x)) << SEMC_IOCR_CLKX1_AO_SHIFT)) & SEMC_IOCR_CLKX1_AO_MASK)
/*! @} */

